// Задача 13
// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645-> 5
// 78-> третьей цифры нет
// 32679-> 6


Console.WriteLine("Введите число.\nИ получите на выходе третью цифру числа.n\Или узнайте, что ее нет.");
while (true)
{
    string input = Console.ReadLine();
    int number = abc;

    Console.WriteLine("{0}->{2}", input, input[2]);
}
    else
    
{
    Console.WriteLine("Третьей цифры нет в числе")
}
    
}